app/views/feeds/facebook.html.erb

SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = ? AND "identities"."provider" = ? LIMIT 1  [["user_id", 11], ["provider", "facebook"]]
---
<div class="row">
  <% if current_user.identities.find_by_provider("facebook") %>