app/views/feeds/twitter.html.erb

<div class="row" style="margin-top: 16px;width: 1000px;">
<% if current_user.identities.find_by_provider("twitter") %>
---
SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = ? AND "identities"."provider" = ? LIMIT 1  [["user_id", 10], ["provider", "twitter"]]