app/controllers/feeds_controller.rb

def facebook
if current_user.identities
 identity = current_user.identities.find_by_provider("facebook")
---
SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = ? AND "identities"."provider" = ? LIMIT 1  [["user_id", 11], ["provider", "facebook"]]

def twitter
   if current_user.identities
 identity = current_user.identities.find_by_provider("twitter")
---
SELECT  "identities".* FROM "identities" WHERE "identities"."user_id" = ? AND "identities"."provider" = ? LIMIT 1  [["user_id", 10], ["provider", "twitter"]]